---
kind: property
id: P:Autodesk.Revit.DB.FamilyInstance.StructuralMaterialId
zh: 族实例
source: html/856b95a1-38c9-4d61-59cd-2844f7348984.htm
---
# Autodesk.Revit.DB.FamilyInstance.StructuralMaterialId Property

**中文**: 族实例

Identifies the material that defines the instance's structural analysis properties.

## Syntax (C#)
```csharp
public ElementId StructuralMaterialId { get; set; }
```